{
    "apache2": "The Apache HTTP Server is a free and open-source cross-platform web server software.",
    "github": "GitHub is a developer platform that allows developers to create, store, manage and share their code.",
    "bash": "<abbr title=\"Bourne-Again shell\">Bash</abbr> is a shell program and command language supported by the <abbr title=\"Free Software Foundation\">FSF</abbr> and first developed for the <abbr title=\"GNU is Not Unix\">GNU</abbr> Project by Brian Fox.",
    "blender": "Blender is a free and open-source 3D computer graphics software tool set.",
    "c": "C is a general-purpose programming language. It was created in the 1970s by Dennis Ritchie and remains very widely used and influential.",
    "cities-skylines": "Cities: Skylines is a 2015 city-building game developed by Colossal Order and published by Paradox Interactive. The game is a single-player open-ended city-building simulation.",
    "cpp": "C++ is a high-level, general-purpose programming language created by Danish computer scientist Bjarne Stroustrup.",
    "csharp": "C# is a general-purpose high-level programming language supporting multiple paradigms.",
    "css": "Cascading Style Sheets (CSS) is a style sheet language used for specifying the presentation and styling of a document written in a markup language such as HTML or XML.",
    "csv": "Comma-separated values (CSV) is a text file format that uses commas to separate values, and newlines to separate records.",
    "dotnet": "The .NET platform is a free and open-source, managed computer software framework for Windows, Linux, and macOS operating systems.",
    "figma": "Figma is a collaborative web application for interface design.",
    "gloomaps": "GlooMaps is a simple online visual sitemap tool.",
    "html": "<abbr title=\"HyperText Markup Language\">HTML</abbr> is the standard markup language for documents designed to be displayed in a web browser. It defines the content and structure of web content.",
    "inno-setup": "Inno Setup is a free software script-driven installation system created in Delphi by Jordan Russell. The first version was released in 1997.",
    "java": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible.",
    "javascript": "JavaScript, often abbreviated as JS, is a programming language and core technology of the Web, alongside HTML and CSS.",
    "json": "<abbr title=\"JavaScript Object Notation\">JSON</abbr> is an open standard file format and data interchange format that uses human-readable text to store and transmit data objects consisting of attribute–value pairs and arrays (or other serializable values).",
    "lua": "Lua is a lightweight, high-level, multi-paradigm programming language designed primarily for embedded use in applications.",
    "markdown": "Markdown is a lightweight markup language for creating formatted text using a plain-text editor.",
    "minecraft": "Minecraft is a 2011 sandbox game developed by Mojang Studios and originally released in 2009.",
    "mysql": "MySQL is an open-source relational database management system.",
    "pascal": "Pascal is an imperative and procedural programming language, designed by Niklaus Wirth as a small, efficient language intended to encourage good programming practices using structured programming and data structuring.",
    "pgsql": "PostgreSQL, also known as Postgres, is a free and open-source relational database management system.",
    "php": "<abbr title=\"Personal Homepage\">PHP</abbr> is a general-purpose scripting language geared towards web development, created in 1993.",
    "powershell": "PowerShell is a task automation and configuration management program from Microsoft, consisting of a command-line shell and the associated scripting language.",
    "python": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation.",
    "replit": "Replit is an American start-up and an online <abbr title=\"Integrated Development Environment\">IDE</abbr> that allows creating online programming projects called <em>repls</em>.",
    "sass": "<abbr title=\"Syntactically Awesome Style Sheets\">Sass</abbr> is a preprocessor scripting language that is interpreted or compiled into CSS.",
    "scheme": "Scheme is a dialect of the Lisp family of programming languages. Scheme was created during the 1970s at the <abbr title=\"MIT Computer Science and Artificial Intelligence Laboratory\">MIT AI</abbr> Lab).",
    "smalltalk": "Smalltalk is a purely object oriented programming language (OOP) that was originally created in 1972 for educational use.",
    "sql": "<abbr title=\"Structured Query Language\">SQL</abbr> is a domain-specific language used to manage data, especially in relational database management systems.",
    "sql-workbench": "SQLite is a database engine written in the C programming language.",
    "sqlite": "SQL Workbench/J is a DBMS-independent, cross-platform SQL query tool.",
    "svg": "<abbr title=\"Scalable Vector Graphics\">SVG</abbr> is an XML-based vector image format for defining two-dimensional graphics, having support for interactivity and animation.",
    "tkinter": "Tkinter is a Python binding to the Tk GUI toolkit. It is the standard Python interface to the Tk GUI toolkit.",
    "visual-studio": "Visual Studio is an <abbr title=\"Integrated Development Environment\">IDE</abbr> developed by Microsoft. It is used to develop computer programs.",
    "vs-code": "Visual Studio Code, also commonly referred to as VS Code,[9] is a source-code editor developed by Microsoft for Windows, Linux, macOS and web browsers.",
    "winforms": "Windows Forms is a free and open-source graphical class library included as a part of Microsoft .NET, .NET Framework or Mono.",
    "wpf": "<abbr title=\"Windows Presentation Foundation\">WPF</abbr> is a free and open-source user interface framework for Windows-based desktop applications.",
    "xml": "<abbr title=\"Extensible Markup Language\">XML</abbr> is a markup language and file format for storing, transmitting, and reconstructing arbitrary data.",
    "zig": "Zig is an imperative, general-purpose, statically typed, compiled system programming language designed by Andrew Kelley in 2015 as a successor to C."
}